app/controllers/home_controller.rb

  def index
    if params[:email]
      Mail.create(:email => params[:email])
---
INSERT INTO "mails" ("created_at", "text", "email") VALUES('2011-03-12 05:31:17.888353', NULL, E'kitchener.1@osu.edu') RETURNING "id"